Duet3D/Duet3Expansion/src/atmel/SAMD20_DFP/1.2.91/Atmel.SAMD20_DFP.pdsc
      <condition id="ATSAMD20E15">
         <require Dvendor="Atmel:3" Dname="ATSAMD20E15"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20E14">
         <require Dvendor="Atmel:3" Dname="ATSAMD20E14"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G14B">
         <require Dvendor="Atmel:3" Dname="ATSAMD20G14B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20E15B">
         <require Dvendor="Atmel:3" Dname="ATSAMD20E15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G18">
         <require Dvendor="Atmel:3" Dname="ATSAMD20G18"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G18U">
         <require Dvendor="Atmel:3" Dname="ATSAMD20G18U"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J15B">
         <require Dvendor="Atmel:3" Dname="ATSAMD20J15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G14">
         <require Dvendor="Atmel:3" Dname="ATSAMD20G14"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G17">
         <require Dvendor="Atmel:3" Dname="ATSAMD20G17"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G16">
         <require Dvendor="Atmel:3" Dname="ATSAMD20G16"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G17U">
         <require Dvendor="Atmel:3" Dname="ATSAMD20G17U"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G15">
         <require Dvendor="Atmel:3" Dname="ATSAMD20G15"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J18">
         <require Dvendor="Atmel:3" Dname="ATSAMD20J18"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J16B">
         <require Dvendor="Atmel:3" Dname="ATSAMD20J16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20E16B">
         <require Dvendor="Atmel:3" Dname="ATSAMD20E16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G15B">
         <require Dvendor="Atmel:3" Dname="ATSAMD20G15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J14">
         <require Dvendor="Atmel:3" Dname="ATSAMD20J14"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J15">
         <require Dvendor="Atmel:3" Dname="ATSAMD20J15"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20E14B">
         <require Dvendor="Atmel:3" Dname="ATSAMD20E14B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J17">
         <require Dvendor="Atmel:3" Dname="ATSAMD20J17"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J16">
         <require Dvendor="Atmel:3" Dname="ATSAMD20J16"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J14B">
         <require Dvendor="Atmel:3" Dname="ATSAMD20J14B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G16B">
         <require Dvendor="Atmel:3" Dname="ATSAMD20G16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD20E18">
         <description>Headers and startup code for Atmel ATSAMD20E18</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20/gcc/system_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20/gcc/gcc/startup_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd20/gcc/gcc/samd20e18_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd20/gcc/gcc/samd20e18_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd20/armcc/Device/SAMD20/Source/ARM/startup_SAMD20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd20/armcc/Device/SAMD20/Source/system_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20/iar/system_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20/iar/iar/startup_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd20/iar/iar/samd20e18_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd20/iar/iar/samd20e18_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD20E17">
         <description>Headers and startup code for Atmel ATSAMD20E17</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20/gcc/system_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20/gcc/gcc/startup_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd20/gcc/gcc/samd20e17_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd20/gcc/gcc/samd20e17_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd20/armcc/Device/SAMD20/Source/ARM/startup_SAMD20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd20/armcc/Device/SAMD20/Source/system_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20/iar/system_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20/iar/iar/startup_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd20/iar/iar/samd20e17_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd20/iar/iar/samd20e17_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD20E16">
         <description>Headers and startup code for Atmel ATSAMD20E16</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20/gcc/system_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20/gcc/gcc/startup_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd20/gcc/gcc/samd20e16_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd20/gcc/gcc/samd20e16_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd20/armcc/Device/SAMD20/Source/ARM/startup_SAMD20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd20/armcc/Device/SAMD20/Source/system_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20/iar/system_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20/iar/iar/startup_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd20/iar/iar/samd20e16_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd20/iar/iar/samd20e16_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD20E15">
         <description>Headers and startup code for Atmel ATSAMD20E15</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20/gcc/system_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20/gcc/gcc/startup_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd20/gcc/gcc/samd20e15_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd20/gcc/gcc/samd20e15_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd20/armcc/Device/SAMD20/Source/ARM/startup_SAMD20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd20/armcc/Device/SAMD20/Source/system_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20/iar/system_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20/iar/iar/startup_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd20/iar/iar/samd20e15_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd20/iar/iar/samd20e15_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD20E14">
         <description>Headers and startup code for Atmel ATSAMD20E14</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20/gcc/system_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20/gcc/gcc/startup_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd20/gcc/gcc/samd20e14_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd20/gcc/gcc/samd20e14_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd20/armcc/Device/SAMD20/Source/ARM/startup_SAMD20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd20/armcc/Device/SAMD20/Source/system_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20/iar/system_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20/iar/iar/startup_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd20/iar/iar/samd20e14_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd20/iar/iar/samd20e14_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD20G14B">
         <description>Headers and startup code for Atmel ATSAMD20G14B</description>
         <files>
            <file condition="C" category="include" name="samd20b/include"/>
            <file condition="C" category="header" name="samd20b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20b/gcc/system_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20b/gcc/gcc/startup_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd20b/gcc/gcc/samd20g14b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd20b/gcc/gcc/samd20g14b_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20b/iar/system_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20b/iar/iar/startup_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd20b/iar/iar/samd20g14b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd20b/iar/iar/samd20g14b_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD20E15B">
         <description>Headers and startup code for Atmel ATSAMD20E15B</description>
         <files>
            <file condition="C" category="include" name="samd20b/include"/>
            <file condition="C" category="header" name="samd20b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd20b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd20b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20b/gcc/system_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd20b/gcc/gcc/startup_samd20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd20b/gcc/gcc/samd20e15b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd20b/gcc/gcc/samd20e15b_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20b/iar/system_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd20b/iar/iar/startup_samd20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd20b/iar/iar/samd20e15b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd20b/iar/iar/samd20e15b_sram.icf"
                  attr="config"/>
         </files>
      </component>
